In [1]:
%load_ext sql

In [2]:
%sql mysql+mysqldb://root:admin@localhost/

In [3]:
%%sql
DROP DATABASE IF EXISTS READYHOLS;

 * mysql+mysqldb://root:***@localhost/
18 rows affected.

[]

In [4]:
%%sql
CREATE DATABASE READYHOLS;
USE READYHOLS;

CREATE TABLE user(
    user_id      char(9) not null ,
    username     varchar(30),
    password     varchar(1024),
    email        varchar(30),
    plan_type    char(10),
    sub_mail     boolean,
    share_drive  boolean,
    grp_count    integer,
    upg_count    integer,
    primary key (user_id)
);

CREATE TABLE vacation(
    vac_id       char(9) not null ,
    description  text,
    vac_grp_id   char(9),
    upg_user_id  char(9),
    start_date   date,
    end_date     date,
    budget_limit integer,
    primary key (vac_id),
    foreign key (upg_user_id) references user(user_id) on update cascade on delete cascade
);

CREATE TABLE vacation_grp(
    vac_grp_id   char(9) not null ,
    grp_name     varchar(50),
    vac_grp_pin  varchar(1024),
    primary key (vac_grp_id)
);

CREATE TABLE vac_user_in(
    vac_grp_id   char(9) not null,
    user_id      char(9) not null,
    primary key (vac_grp_id,user_id),
    foreign key (vac_grp_id) references vacation_grp(vac_grp_id) on update cascade on delete cascade,
    foreign key (user_id) references user(user_id) on update cascade on delete cascade
);

CREATE TABLE budget(
    vac_id       char(9) not null,
    budget_id    char(9) not null,
    category     varchar(30),
    expenditure  integer,
    remarks      text,
    primary key (vac_id,budget_id),
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade
);

CREATE TABLE album(
    alb_id       char(9) not null ,
    alb_name     varchar(50),
    alb_date     date,
    vac_id       char(9) not null,
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade,
    primary key (alb_id)
);

CREATE TABLE photo(
    photo_id     char(9) not null ,
    photolink    varchar(1024),
    alb_id       char(9),
    primary key (photo_id),
    foreign key (alb_id) references album(alb_id) on update cascade on delete cascade
);

CREATE TABLE booking(
    vac_id       char(9) not null ,
    ref_no       varchar(30),
    booking_type varchar(30),
    description  text,
    attachment   varchar(1024),
    primary key (vac_id,ref_no),
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade
);

CREATE TABLE itinerary(
    vac_id       char(9) not null ,
    day_no       integer not null,
    itin_time    time not null,
    itin_type    varchar(30),
    description  varchar(100),
    location     varchar(50),
    primary key (vac_id, day_no, itin_time),
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade
);

CREATE TABLE destination(
    dest_id      char(9) not null,
    country      varchar(50),
    state        varchar(50),
    primary key (dest_id)
);

CREATE TABLE has_destination(
    vac_id       char(9) not null,
    dest_id      char(9) not null,
    no_days      integer not null,
    dstart_date  date not null,
    primary key (vac_id, dest_id, no_days, dstart_date),
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade,
    foreign key (dest_id) references destination(dest_id) on update cascade on delete cascade
);

CREATE TABLE vac_map(
    map_id       char(9) not null ,
    map_link     varchar(1024),
    name         varchar(50),
    category     varchar(30),
    primary key (map_id)
);

CREATE TABLE ref_map_itin(
    vac_id       char(9) not null ,
    itin_time    time not null,
    day_no       integer not null,
    map_id       char(9) not null,
    primary key (vac_id, day_no, itin_time, map_id),
    foreign key (vac_id, day_no, itin_time) references itinerary(vac_id, day_no, itin_time) on update cascade on delete cascade,
    foreign key (map_id) references vac_map(map_id) on update cascade on delete cascade
);


alter table vacation add foreign key(vac_grp_id) references vacation_grp(vac_grp_id) on delete cascade on update cascade;

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [5]:
%%sql
grant all privileges on readyhols.* to 'root'@'localhost';
flush privileges;

 * mysql+mysqldb://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [6]:
from werkzeug.security import check_password_hash, generate_password_hash

(username,password)
(anna,12345678)
(benny,abcdefgh)
(charlie,56789012)
(daniel,DANIEL12)
(elliot,iLoveCSS)
(francis,56789012)

In [7]:
%%sql
INSERT INTO user VALUES("000000001","anna",'pbkdf2:sha256:260000$Jxu38JhpUtj2KORr$55d32b66ff58895a05b949a82c6f36b99155a1756c979c958cd5ba9768b4e277',"anna123@nushigh.edu.sg","Basic",false,false,3,0);
INSERT INTO user VALUES("000000002","benny",'pbkdf2:sha256:260000$Mcpq3Myee1i5bCtT$ba786e92ef49008cd901eaea9f4c3755ee6744f6e278750b80a73ca12174ef76',"bennyLee@nushigh.edu.sg","Premium",true,false,5,2);
INSERT INTO user VALUES("000000003","charlie",'pbkdf2:sha256:260000$uo8D9nnQq19HeQ9M$c28d7c62fde881951f6df3af255b94b36d430eaa10446545433f8b82705feba3',"charlieC@nushigh.edu.sg","Plus",false,true,3,0);
INSERT INTO user VALUES("000000004","daniel",'pbkdf2:sha256:260000$JOUbwJQb9uYD3ak4$73083e4b3782fd6e3f3c7cb53993ce7e0e30444ac70d09e8d52c9de55d5950f4',"dan_iel@nushigh.edu.sg","Plus",false,true,1,1);
INSERT INTO user VALUES("000000005","elliot",'pbkdf2:sha256:260000$dFLTKchGWUAW3mAi$9d736306a948c332fa964e32a5ff3512d8ee3ed3f9ad8d39a84b06322ced5d1e',"elliot_@nushigh.edu.sg","Basic",false,true,2,0);
INSERT INTO user VALUES("000000006","francis",'pbkdf2:sha256:260000$SVcQ1PKIbRUOPCc9$34210b10d536c98190931926489602b549e944b2e55a820ba1958981bca9fbbe',"fh123@nushigh.edu.sg","Premium",true,true,1,1);

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Vacation Grp Pins
(000000001,345677725845)
(000000002,524638776254)
(000000003,296729573058)
(000000004,108394827503)
(000000005,104927684838)
(000000006,234098134099)

In [8]:
%%sql

INSERT INTO vacation_grp VALUES("000000001","Lee Family","pbkdf2:sha256:260000$yVjpAlTNHDLnkaYI$5bf657ad985560ab03969a06305fb3d823757c7058d792e01316da5922145ab9");
INSERT INTO vacation_grp VALUES("000000002","Teoh Family","pbkdf2:sha256:260000$teETLSB9xJaY0VeB$58d8cfeaaa1da459f186cd9b5f0a8e2de0d165866e233ee0252e548e7244fbbd");
INSERT INTO vacation_grp VALUES("000000003","Tan Family","pbkdf2:sha256:260000$cktvJI8HoWIypb8i$afefc233c4ad296a5e1c76097a41e97a655bd6a101852d8ea005052352bf3cba");
INSERT INTO vacation_grp VALUES("000000004","CS Major Family","pbkdf2:sha256:260000$dlfql9wjkNGNSQ1X$d69bc9ef22e24a90b19055322827a8c2ba1cb1f1ee4a9dfa0265b32b55d4e75e");
INSERT INTO vacation_grp VALUES("000000005","OSAP TRIP GROUP","pbkdf2:sha256:260000$5TL2ZMPb1LpeGypC$c0884f7b9926d312ee3ebbfdccd19d9bf70437a15d8b155acdc48c14e4b27d77");
INSERT INTO vacation_grp VALUES("000000006","Cluster 12A","pbkdf2:sha256:260000$Vu7ni5rPG3TcwUsn$c5c825d27fc2f7229f3e4710fddb96e9d47bcbf2634d5f9041b1755c9db938a0");

INSERT INTO vacation VALUES("000000001","Trip to Malaysia","000000003",null,"2023-02-13","2023-02-16",5000);
INSERT INTO vacation VALUES("000000002","Trip to Japan","000000001","000000002","2023-03-29","2023-04-11",8000);
INSERT INTO vacation VALUES("000000003","Trip to Germany","000000002","000000002","2023-02-26","2023-05-10",10000);
INSERT INTO vacation VALUES("000000004","Trip to USA","000000005","000000006","2023-06-13","2023-06-20",20000);
INSERT INTO vacation VALUES("000000005","Trip to Switzerland","000000005","000000004","2023-06-02","2023-06-20",25000);
INSERT INTO vacation VALUES("000000006","Trip to Australia","000000004",null,"2023-05-01","2023-05-30",50000);

INSERT INTO vac_user_in VALUES("000000001","000000002");
INSERT INTO vac_user_in VALUES("000000001","000000003");
INSERT INTO vac_user_in VALUES("000000001","000000005");
INSERT INTO vac_user_in VALUES("000000002","000000002");
INSERT INTO vac_user_in VALUES("000000003","000000001");
INSERT INTO vac_user_in VALUES("000000003","000000002");
INSERT INTO vac_user_in VALUES("000000004","000000001");
INSERT INTO vac_user_in VALUES("000000004","000000003");
INSERT INTO vac_user_in VALUES("000000004","000000006");
INSERT INTO vac_user_in VALUES("000000005","000000001");
INSERT INTO vac_user_in VALUES("000000005","000000002");
INSERT INTO vac_user_in VALUES("000000005","000000003");
INSERT INTO vac_user_in VALUES("000000005","000000004");
INSERT INTO vac_user_in VALUES("000000005","000000005");
INSERT INTO vac_user_in VALUES("000000006","000000002");

INSERT INTO budget VALUES("000000001","000000001","FOOD",1000,"Italian Restaurant LeFeu");
INSERT INTO budget VALUES("000000001","000000002","FOOD",500,"Japanese Omurice");
INSERT INTO budget VALUES("000000002","000000001","ATTRACTION",8000,"Universal Studios Malaysia");
INSERT INTO budget VALUES("000000002","000000002","OTHERS",5000,"Shopping Expenses");
INSERT INTO budget VALUES("000000002","000000003","FOOD",2000,"Seafood Restaurant");
INSERT INTO budget VALUES("000000003","000000001","TRANSPORT",200,"Concession Card Fees");
INSERT INTO budget VALUES("000000004","000000001","FOOD",10000,"Din Tai Fung Day 3");
INSERT INTO budget VALUES("000000005","000000001","FOOD",300,"Macdonalds");
INSERT INTO budget VALUES("000000006","000000001","FOOD",600,"Chinese Restaurant");

INSERT INTO album VALUES("000000001","Memories of Japan Part 1","2023-04-10","000000002");
INSERT INTO album VALUES("000000002","Memories of Japan Part 2","2023-04-15","000000002");
INSERT INTO album VALUES("000000003","Memories of Germany","2023-02-25","000000003");
INSERT INTO album VALUES("000000004","Memories of USA","2023-06-20","000000004");
INSERT INTO album VALUES("000000005","Memories of Switzerland Part 1","2023-06-23","000000005");
INSERT INTO album VALUES("000000006","Memories of Switzerland Part 2","2023-06-25","000000005");

INSERT INTO photo VALUES("000000001","/pictures/picture1.png","000000002");
INSERT INTO photo VALUES("000000002","/pictures/picture2.png","000000005");
INSERT INTO photo VALUES("000000003","/pictures/picture3.jpg","000000003");
INSERT INTO photo VALUES("000000004","/pictures/picture4.jpg","000000003");
INSERT INTO photo VALUES("000000005","/pictures/picture5.jpg","000000002");
INSERT INTO photo VALUES("000000006","/pictures/picture6.jpg",null);

INSERT INTO booking VALUES("000000001","20957134LAS","TRANSPORT","air ticket to malaysia","/booking-attachment/20957134LAS.pdf");
INSERT INTO booking VALUES("000000002","57186275DGA","FOOD","reservation for restaurant","/booking-attachment/57186275DGA.pdf");
INSERT INTO booking VALUES("000000003","56246593GLK","INSURANCE","basic insurance","/booking-attachment/56246593GLK.pdf");
INSERT INTO booking VALUES("000000004","05782485KXN","ATTRACTION","premium tickets to museum","/booking-attachment/05782485KXN.pdf");
INSERT INTO booking VALUES("000000005","09562434MAS","TRANSPORT","air ticket to switzerland","/booking-attachment/09562434MAS.pdf");
INSERT INTO booking VALUES("000000006","23409845KFS","TRANSPORT","air ticket to australia","/booking-attachment/23409845KFS.pdf");

INSERT INTO itinerary VALUES("000000001",1,"09:00:00","ATTRACTION","penang street","George Town");
INSERT INTO itinerary VALUES("000000001",1,"12:00:00","FOOD","penang street food","Penang Street 1");
INSERT INTO itinerary VALUES("000000001",2,"08:00:00","TOUR","malaysia heritage tour","Penang Street 5");
INSERT INTO itinerary VALUES("000000005",1,"14:00:00","SIGHTSEEING","penang street","Penang Street");
INSERT INTO itinerary VALUES("000000005",1,"18:00:00","TOUR","CERN Site Tour","CERN");
INSERT INTO itinerary VALUES("000000003",1,"09:00:00","FOOD","Christmas market food","Braubachstra√üe");
INSERT INTO itinerary VALUES("000000003",1,"11:00:00","OTHERS","Shopping","Rewe Gottingen");

INSERT INTO destination VALUES("000000001","Malaysia","Penang");
INSERT INTO destination VALUES("000000002","Japan","Tokyo");
INSERT INTO destination VALUES("000000003","Japan","Hokkaido");
INSERT INTO destination VALUES("000000004","Germany","Gottingen");
INSERT INTO destination VALUES("000000005","USA","California");
INSERT INTO destination VALUES("000000006","Switzerland","Bern");
INSERT INTO destination VALUES("000000007","Australia","Tasmania");

INSERT INTO has_destination VALUES("000000001","000000001",4,"2023-02-13");
INSERT INTO has_destination VALUES("000000002","000000002",2,"2023-03-31");
INSERT INTO has_destination VALUES("000000002","000000003",3,"2023-04-07");
INSERT INTO has_destination VALUES("000000003","000000004",14,"2023-02-28");
INSERT INTO has_destination VALUES("000000004","000000005",2,"2023-06-15");
INSERT INTO has_destination VALUES("000000005","000000006",2,"2023-06-02");
INSERT INTO has_destination VALUES("000000006","000000007",10,"2023-05-01");

INSERT INTO vac_map VALUES("000000001","/map-attachment/map-penang.pdf","Map of Penang","GENERAL");
INSERT INTO vac_map VALUES("000000002","/map-attachment/map-japan-mrt.pdf","Map of Japan MRT Lines","TRANSPORT");
INSERT INTO vac_map VALUES("000000003","/map-attachment/map-gemany-rewe.pdf","Map of Germany Shopping Mall Rewe","OTHERS");
INSERT INTO vac_map VALUES("000000004","/map-attachment/map-usa-california.pdf","Map of USA State California","GENERAL");
INSERT INTO vac_map VALUES("000000005","/map-attachment/map-switz-museum.pdf","Map of Switzerland Museum","ATTRACTION");
INSERT INTO vac_map VALUES("000000006","/map-attachment/map-aus-tasmania.pdf","Terrain Guide of Australia Tasmania","OTHERS");
INSERT INTO vac_map VALUES("000000007","/map-attachment/map-christmas-market.pdf","Christmas Market Highlights","OTHERS");
INSERT INTO vac_map VALUES("000000008","/map-attachment/map-panang-recommend.pdf","Penang Street Recommended Locations","ATTRACTION");
INSERT INTO vac_map VALUES("000000009","/map-attachment/map-cern.pdf","CERN Building","OTHERS");
INSERT INTO vac_map VALUES("000000010","/map-attachment/map-german-bus.pdf","Germany Bus Timings","TRANSPORT");

INSERT INTO ref_map_itin VALUES("000000001","09:00:00",1,"000000001");
INSERT INTO ref_map_itin VALUES("000000003","11:00:00",1,"000000003");
INSERT INTO ref_map_itin VALUES("000000003","09:00:00",1,"000000007");
INSERT INTO ref_map_itin VALUES("000000001","12:00:00",1,"000000008");
INSERT INTO ref_map_itin VALUES("000000005","18:00:00",1,"000000009");
INSERT INTO ref_map_itin VALUES("000000003","09:00:00",1,"000000010");
INSERT INTO ref_map_itin VALUES("000000003","11:00:00",1,"000000010");

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [9]:
%%sql

Create view vacation_summary as

(select expenditure_summary_tbl.vac_id, start_date, end_date, first_state, first_country, last_state, last_country, 
datediff(end_date,start_date) as days, budget_limit, total_spend, remaining_budget from 

(select start_destination_tbl.vac_id, first_state, first_country, last_state, last_country from
(select vac_id,state as first_state,country as first_country from destination d1, has_destination hd1
where dstart_date <= all (select dstart_date from has_destination hd2, destination d2
where hd2.vac_id = hd1.vac_id and hd2.dest_id = d2.dest_id) and hd1.dest_id = d1.dest_id) as start_destination_tbl

join 

(select vac_id,state as last_state,country as last_country from destination d3, has_destination hd3
where dstart_date >= all (select dstart_date from has_destination hd4, destination d4 
where hd4.vac_id = hd3.vac_id and hd4.dest_id = d4.dest_id) and d3.dest_id = hd3.dest_id) as end_destination_tbl

on start_destination_tbl.vac_id = end_destination_tbl.vac_id) as destination_summary_tbl

right join  

(select start_end_vac.vac_id, start_date, end_date, days, budget_limit, total_spend, remaining_budget from
(select vac_id, start_date, end_date, datediff(end_date,start_date) as days from vacation) as start_end_vac

join

(select vac_id, budget_limit, 
case
    when total_spend is null then 0
    else total_spend
end as total_spend,

case
    when remaining_budget is null then budget_limit
    else remaining_budget
end as remaining_budget

from 
    
(select vacation_tbl.vac_id, budget_limit, total_spend, budget_limit-total_spend as remaining_budget 

from 
(select vacation.vac_id, budget_limit from vacation) as vacation_tbl

left join

(select budget.vac_id, sum(expenditure) as total_spend from budget group by budget.vac_id) as budget_tbl

on vacation_tbl.vac_id = budget_tbl.vac_id) as before_process_budget) as expense_tbl

on start_end_vac.vac_id = expense_tbl.vac_id) as expenditure_summary_tbl

on expenditure_summary_tbl.vac_id = destination_summary_tbl.vac_id)

 * mysql+mysqldb://root:***@localhost/
0 rows affected.

[]

In [10]:
%%sql
Create view vac_user_has as
select user.user_id,vacation.vac_id from user,vacation,vac_user_in
where user.user_id = vac_user_in.user_id and vac_user_in.vac_grp_id = vacation.vac_grp_id;
select * from vac_user_has

 * mysql+mysqldb://root:***@localhost/
0 rows affected.
19 rows affected.

[('000000002', '000000002'),
 ('000000003', '000000002'),
 ('000000005', '000000002'),
 ('000000002', '000000003'),
 ('000000001', '000000001'),
 ('000000002', '000000001'),
 ('000000001', '000000006'),
 ('000000003', '000000006'),
 ('000000006', '000000006'),
 ('000000001', '000000004'),
 ('000000002', '000000004'),
 ('000000003', '000000004'),
 ('000000004', '000000004'),
 ('000000005', '000000004'),
 ('000000001', '000000005'),
 ('000000002', '000000005'),
 ('000000003', '000000005'),
 ('000000004', '000000005'),
 ('000000005', '000000005')]

In [11]:
%%sql
select vacation.vac_id,description,start_date from vacation,vac_user_has
where vacation.vac_id = vac_user_has.vac_id and vac_user_has.user_id = "000000001"

 * mysql+mysqldb://root:***@localhost/
4 rows affected.

[('000000001', 'Trip to Malaysia', datetime.date(2023, 2, 13)),
 ('000000006', 'Trip to Australia', datetime.date(2023, 5, 1)),
 ('000000004', 'Trip to USA', datetime.date(2023, 6, 13)),
 ('000000005', 'Trip to Switzerland', datetime.date(2023, 6, 2))]

In [12]:
%%sql
#album photos table

Create view user_photos as

(select vac_user_has.user_id, vac_user_has.vac_id, photo.photo_id from photo, album, vac_user_has
where album.vac_id = vac_user_has.vac_id and photo.alb_id = album.alb_id)

union

#public photos_table
(select null as user_id, null as vac_id, photo_id from photo where photo.alb_id is null)

 * mysql+mysqldb://root:***@localhost/
0 rows affected.

[]

#### Query 3

In [13]:
%%sql    
select *, date_add(dstart_date, interval (no_days-1) day) dend_date from has_destination, destination
where destination.dest_id = has_destination.dest_id

 * mysql+mysqldb://root:***@localhost/
7 rows affected.

[('000000001', '000000001', 4, datetime.date(2023, 2, 13), '000000001', 'Malaysia', 'Penang', datetime.date(2023, 2, 16)),
 ('000000002', '000000002', 2, datetime.date(2023, 3, 31), '000000002', 'Japan', 'Tokyo', datetime.date(2023, 4, 1)),
 ('000000002', '000000003', 3, datetime.date(2023, 4, 7), '000000003', 'Japan', 'Hokkaido', datetime.date(2023, 4, 9)),
 ('000000003', '000000004', 14, datetime.date(2023, 2, 28), '000000004', 'Germany', 'Gottingen', datetime.date(2023, 3, 13)),
 ('000000004', '000000005', 2, datetime.date(2023, 6, 15), '000000005', 'USA', 'California', datetime.date(2023, 6, 16)),
 ('000000005', '000000006', 2, datetime.date(2023, 6, 2), '000000006', 'Switzerland', 'Bern', datetime.date(2023, 6, 3)),
 ('000000006', '000000007', 10, datetime.date(2023, 5, 1), '000000007', 'Australia', 'Tasmania', datetime.date(2023, 5, 10))]

In [14]:
%%sql

Create view vacation_itinerary as

select sub_timeline_tbl.vac_id, itin_date, itin_time, itin_type, description, location, country, state, day_no from 
(select itinerary.vac_id, day_no, itin_time, itin_type, description, location,
date_add(start_date, interval (day_no-1) day) as itin_date from 

itinerary

join 

(select vac_id, start_date from vacation) as vacation_tbl

on itinerary.vac_id = vacation_tbl.vac_id) as sub_timeline_tbl

left join

(select vac_id, has_destination.dest_id, no_days, dstart_date, country, state, 
 date_add(dstart_date, interval (no_days-1) day) dend_date from has_destination, destination
where destination.dest_id = has_destination.dest_id) as destination_tbl

on sub_timeline_tbl.vac_id = destination_tbl.vac_id and 
(sub_timeline_tbl.itin_date >= dstart_date and sub_timeline_tbl.itin_date <=dend_date)

 * mysql+mysqldb://root:***@localhost/
0 rows affected.

[]

In [15]:
%%sql
create trigger insert_vacation
after insert on vacation
for each row update user 
set upg_count = upg_count + 1
where user_id = new.upg_user_id
;

 * mysql+mysqldb://root:***@localhost/
0 rows affected.

[]

In [16]:
%%sql
create trigger update_vacation
after update on vacation
for each row 
update user 
set upg_count = upg_count + 1
where (((old.upg_user_id <> new.upg_user_id) or (old.upg_user_id is null)) and (user_id = new.upg_user_id));

 * mysql+mysqldb://root:***@localhost/
0 rows affected.

[]

In [17]:
%%sql
create trigger insert_vac_grp
after insert on vac_user_in
for each row 
update user 
set grp_count = grp_count + 1
where (user_id = new.user_id);

 * mysql+mysqldb://root:***@localhost/
0 rows affected.

[]

In [18]:
%%sql
select * from budget

 * mysql+mysqldb://root:***@localhost/
9 rows affected.

[('000000001', '000000001', 'FOOD', 1000, 'Italian Restaurant LeFeu'),
 ('000000001', '000000002', 'FOOD', 500, 'Japanese Omurice'),
 ('000000002', '000000001', 'ATTRACTION', 8000, 'Universal Studios Malaysia'),
 ('000000002', '000000002', 'OTHERS', 5000, 'Shopping Expenses'),
 ('000000002', '000000003', 'FOOD', 2000, 'Seafood Restaurant'),
 ('000000003', '000000001', 'TRANSPORT', 200, 'Concession Card Fees'),
 ('000000004', '000000001', 'FOOD', 10000, 'Din Tai Fung Day 3'),
 ('000000005', '000000001', 'FOOD', 300, 'Macdonalds'),
 ('000000006', '000000001', 'FOOD', 600, 'Chinese Restaurant')]

In [19]:
%%sql
SELECT * from vacation_summary

 * mysql+mysqldb://root:***@localhost/
6 rows affected.

[('000000001', datetime.date(2023, 2, 13), datetime.date(2023, 2, 16), 'Penang', 'Malaysia', 'Penang', 'Malaysia', 3, 5000, Decimal('1500'), Decimal('3500')),
 ('000000002', datetime.date(2023, 3, 29), datetime.date(2023, 4, 11), 'Tokyo', 'Japan', 'Hokkaido', 'Japan', 13, 8000, Decimal('15000'), Decimal('-7000')),
 ('000000003', datetime.date(2023, 2, 26), datetime.date(2023, 5, 10), 'Gottingen', 'Germany', 'Gottingen', 'Germany', 73, 10000, Decimal('200'), Decimal('9800')),
 ('000000004', datetime.date(2023, 6, 13), datetime.date(2023, 6, 20), 'California', 'USA', 'California', 'USA', 7, 20000, Decimal('10000'), Decimal('10000')),
 ('000000005', datetime.date(2023, 6, 2), datetime.date(2023, 6, 20), 'Bern', 'Switzerland', 'Bern', 'Switzerland', 18, 25000, Decimal('300'), Decimal('24700')),
 ('000000006', datetime.date(2023, 5, 1), datetime.date(2023, 5, 30), 'Tasmania', 'Australia', 'Tasmania', 'Australia', 29, 50000, Decimal('600'), Decimal('49400'))]

In [20]:
%%sql
select * from destination

 * mysql+mysqldb://root:***@localhost/
7 rows affected.

[('000000001', 'Malaysia', 'Penang'),
 ('000000002', 'Japan', 'Tokyo'),
 ('000000003', 'Japan', 'Hokkaido'),
 ('000000004', 'Germany', 'Gottingen'),
 ('000000005', 'USA', 'California'),
 ('000000006', 'Switzerland', 'Bern'),
 ('000000007', 'Australia', 'Tasmania')]

In [21]:
%%sql
select vac_id, destination.dest_id, no_days, dstart_date, country, state from 
(has_destination
 
join

destination
 
on has_destination.dest_id = destination.dest_id)

where vac_id = "000000002"

 * mysql+mysqldb://root:***@localhost/
2 rows affected.

[('000000002', '000000002', 2, datetime.date(2023, 3, 31), 'Japan', 'Tokyo'),
 ('000000002', '000000003', 3, datetime.date(2023, 4, 7), 'Japan', 'Hokkaido')]

In [22]:
%%sql
select * from vac_map

 * mysql+mysqldb://root:***@localhost/
10 rows affected.

[('000000001', '/map-attachment/map-penang.pdf', 'Map of Penang', 'GENERAL'),
 ('000000002', '/map-attachment/map-japan-mrt.pdf', 'Map of Japan MRT Lines', 'TRANSPORT'),
 ('000000003', '/map-attachment/map-gemany-rewe.pdf', 'Map of Germany Shopping Mall Rewe', 'OTHERS'),
 ('000000004', '/map-attachment/map-usa-california.pdf', 'Map of USA State California', 'GENERAL'),
 ('000000005', '/map-attachment/map-switz-museum.pdf', 'Map of Switzerland Museum', 'ATTRACTION'),
 ('000000006', '/map-attachment/map-aus-tasmania.pdf', 'Terrain Guide of Australia Tasmania', 'OTHERS'),
 ('000000007', '/map-attachment/map-christmas-market.pdf', 'Christmas Market Highlights', 'OTHERS'),
 ('000000008', '/map-attachment/map-panang-recommend.pdf', 'Penang Street Recommended Locations', 'ATTRACTION'),
 ('000000009', '/map-attachment/map-cern.pdf', 'CERN Building', 'OTHERS'),
 ('000000010', '/map-attachment/map-german-bus.pdf', 'Germany Bus Timings', 'TRANSPORT')]

In [23]:
%%sql
create view maps_itinerary_tbl as 
select vacation_itinerary.vac_id, vacation_itinerary.itin_time, vacation_itinerary.day_no, maps_tbl.map_id, map_link, description, name, category from
(select vac_id, itin_time, day_no, vac_map.map_id, map_link, name, category from 

(ref_map_itin join vac_map on vac_map.map_id = ref_map_itin.map_id)) as maps_tbl

join 

vacation_itinerary

on (vacation_itinerary.day_no = maps_tbl.day_no) and (vacation_itinerary.itin_time = maps_tbl.itin_time) 
and (vacation_itinerary.vac_id = maps_tbl.vac_id)

 * mysql+mysqldb://root:***@localhost/
0 rows affected.

[]

In [24]:
%%sql
select * from vacation_itinerary

 * mysql+mysqldb://root:***@localhost/
7 rows affected.

[('000000001', datetime.date(2023, 2, 13), datetime.timedelta(seconds=32400), 'ATTRACTION', 'penang street', 'George Town', 'Malaysia', 'Penang', 1),
 ('000000001', datetime.date(2023, 2, 13), datetime.timedelta(seconds=43200), 'FOOD', 'penang street food', 'Penang Street 1', 'Malaysia', 'Penang', 1),
 ('000000001', datetime.date(2023, 2, 14), datetime.timedelta(seconds=28800), 'TOUR', 'malaysia heritage tour', 'Penang Street 5', 'Malaysia', 'Penang', 2),
 ('000000003', datetime.date(2023, 2, 26), datetime.timedelta(seconds=32400), 'FOOD', 'Christmas market food', 'Braubachstra√üe', None, None, 1),
 ('000000003', datetime.date(2023, 2, 26), datetime.timedelta(seconds=39600), 'OTHERS', 'Shopping', 'Rewe Gottingen', None, None, 1),
 ('000000005', datetime.date(2023, 6, 2), datetime.timedelta(seconds=50400), 'SIGHTSEEING', 'penang street', 'Penang Street', 'Switzerland', 'Bern', 1),
 ('000000005', datetime.date(2023, 6, 2), datetime.timedelta(seconds=64800), 'TOUR', 'CERN Site Tour', 'CERN', 'Switzerland', 'Bern', 1)]

In [25]:
%%sql
select * from maps_itinerary_tbl

 * mysql+mysqldb://root:***@localhost/
7 rows affected.

[('000000001', datetime.timedelta(seconds=32400), 1, '000000001', '/map-attachment/map-penang.pdf', 'penang street', 'Map of Penang', 'GENERAL'),
 ('000000001', datetime.timedelta(seconds=43200), 1, '000000008', '/map-attachment/map-panang-recommend.pdf', 'penang street food', 'Penang Street Recommended Locations', 'ATTRACTION'),
 ('000000003', datetime.timedelta(seconds=32400), 1, '000000007', '/map-attachment/map-christmas-market.pdf', 'Christmas market food', 'Christmas Market Highlights', 'OTHERS'),
 ('000000003', datetime.timedelta(seconds=32400), 1, '000000010', '/map-attachment/map-german-bus.pdf', 'Christmas market food', 'Germany Bus Timings', 'TRANSPORT'),
 ('000000003', datetime.timedelta(seconds=39600), 1, '000000003', '/map-attachment/map-gemany-rewe.pdf', 'Shopping', 'Map of Germany Shopping Mall Rewe', 'OTHERS'),
 ('000000003', datetime.timedelta(seconds=39600), 1, '000000010', '/map-attachment/map-german-bus.pdf', 'Shopping', 'Germany Bus Timings', 'TRANSPORT'),
 ('000000005', datetime.timedelta(seconds=64800), 1, '000000009', '/map-attachment/map-cern.pdf', 'CERN Site Tour', 'CERN Building', 'OTHERS')]

In [26]:
%%sql
select * from vacation

 * mysql+mysqldb://root:***@localhost/
6 rows affected.

[('000000001', 'Trip to Malaysia', '000000003', None, datetime.date(2023, 2, 13), datetime.date(2023, 2, 16), 5000),
 ('000000002', 'Trip to Japan', '000000001', '000000002', datetime.date(2023, 3, 29), datetime.date(2023, 4, 11), 8000),
 ('000000003', 'Trip to Germany', '000000002', '000000002', datetime.date(2023, 2, 26), datetime.date(2023, 5, 10), 10000),
 ('000000004', 'Trip to USA', '000000005', '000000006', datetime.date(2023, 6, 13), datetime.date(2023, 6, 20), 20000),
 ('000000005', 'Trip to Switzerland', '000000005', '000000004', datetime.date(2023, 6, 2), datetime.date(2023, 6, 20), 25000),
 ('000000006', 'Trip to Australia', '000000004', None, datetime.date(2023, 5, 1), datetime.date(2023, 5, 30), 50000)]

In [27]:
%%sql
select * from album

 * mysql+mysqldb://root:***@localhost/
6 rows affected.

[('000000001', 'Memories of Japan Part 1', datetime.date(2023, 4, 10), '000000002'),
 ('000000002', 'Memories of Japan Part 2', datetime.date(2023, 4, 15), '000000002'),
 ('000000003', 'Memories of Germany', datetime.date(2023, 2, 25), '000000003'),
 ('000000004', 'Memories of USA', datetime.date(2023, 6, 20), '000000004'),
 ('000000005', 'Memories of Switzerland Part 1', datetime.date(2023, 6, 23), '000000005'),
 ('000000006', 'Memories of Switzerland Part 2', datetime.date(2023, 6, 25), '000000005')]

In [28]:
%%sql
select vac_grp_tbl.vac_grp_id, grp_name, vac_grp_pin from 
(select vu2.vac_grp_id from vac_user_in vu2 where user_id="000000001") as vac_user_tbl
join
(select * from vacation_grp) as vac_grp_tbl
on vac_grp_tbl.vac_grp_id = vac_user_tbl.vac_grp_id
order by vac_grp_tbl.vac_grp_id

 * mysql+mysqldb://root:***@localhost/
3 rows affected.

[('000000003', 'Tan Family', 'pbkdf2:sha256:260000$cktvJI8HoWIypb8i$afefc233c4ad296a5e1c76097a41e97a655bd6a101852d8ea005052352bf3cba'),
 ('000000004', 'CS Major Family', 'pbkdf2:sha256:260000$dlfql9wjkNGNSQ1X$d69bc9ef22e24a90b19055322827a8c2ba1cb1f1ee4a9dfa0265b32b55d4e75e'),
 ('000000005', 'OSAP TRIP GROUP', 'pbkdf2:sha256:260000$5TL2ZMPb1LpeGypC$c0884f7b9926d312ee3ebbfdccd19d9bf70437a15d8b155acdc48c14e4b27d77')]

In [29]:
%%sql
select vac_grp_id, user.user_id, username from vac_user_in, user
where user.user_id = vac_user_in.user_id and 
(vac_grp_id in (select vu2.vac_grp_id from vac_user_in vu2 where user_id="000000001"))
and user.user_id<>"000000001"

 * mysql+mysqldb://root:***@localhost/
7 rows affected.

[('000000003', '000000002', 'benny'),
 ('000000004', '000000003', 'charlie'),
 ('000000004', '000000006', 'francis'),
 ('000000005', '000000002', 'benny'),
 ('000000005', '000000003', 'charlie'),
 ('000000005', '000000004', 'daniel'),
 ('000000005', '000000005', 'elliot')]

In [30]:
%%sql
select distinct alb_id, photo.photo_id, photolink from 
(user_photos
join 
photo
on photo.photo_id = user_photos.photo_id)

 * mysql+mysqldb://root:***@localhost/
6 rows affected.

[('000000002', '000000001', '/pictures/picture1.png'),
 ('000000005', '000000002', '/pictures/picture2.png'),
 ('000000003', '000000003', '/pictures/picture3.jpg'),
 ('000000003', '000000004', '/pictures/picture4.jpg'),
 ('000000002', '000000005', '/pictures/picture5.jpg'),
 (None, '000000006', '/pictures/picture6.jpg')]

In [31]:
%%sql
select * from vacation_grp

 * mysql+mysqldb://root:***@localhost/
6 rows affected.

[('000000001', 'Lee Family', 'pbkdf2:sha256:260000$yVjpAlTNHDLnkaYI$5bf657ad985560ab03969a06305fb3d823757c7058d792e01316da5922145ab9'),
 ('000000002', 'Teoh Family', 'pbkdf2:sha256:260000$teETLSB9xJaY0VeB$58d8cfeaaa1da459f186cd9b5f0a8e2de0d165866e233ee0252e548e7244fbbd'),
 ('000000003', 'Tan Family', 'pbkdf2:sha256:260000$cktvJI8HoWIypb8i$afefc233c4ad296a5e1c76097a41e97a655bd6a101852d8ea005052352bf3cba'),
 ('000000004', 'CS Major Family', 'pbkdf2:sha256:260000$dlfql9wjkNGNSQ1X$d69bc9ef22e24a90b19055322827a8c2ba1cb1f1ee4a9dfa0265b32b55d4e75e'),
 ('000000005', 'OSAP TRIP GROUP', 'pbkdf2:sha256:260000$5TL2ZMPb1LpeGypC$c0884f7b9926d312ee3ebbfdccd19d9bf70437a15d8b155acdc48c14e4b27d77'),
 ('000000006', 'Cluster 12A', 'pbkdf2:sha256:260000$Vu7ni5rPG3TcwUsn$c5c825d27fc2f7229f3e4710fddb96e9d47bcbf2634d5f9041b1755c9db938a0')]

In [32]:
%%sql
select * from budget

 * mysql+mysqldb://root:***@localhost/
9 rows affected.

[('000000001', '000000001', 'FOOD', 1000, 'Italian Restaurant LeFeu'),
 ('000000001', '000000002', 'FOOD', 500, 'Japanese Omurice'),
 ('000000002', '000000001', 'ATTRACTION', 8000, 'Universal Studios Malaysia'),
 ('000000002', '000000002', 'OTHERS', 5000, 'Shopping Expenses'),
 ('000000002', '000000003', 'FOOD', 2000, 'Seafood Restaurant'),
 ('000000003', '000000001', 'TRANSPORT', 200, 'Concession Card Fees'),
 ('000000004', '000000001', 'FOOD', 10000, 'Din Tai Fung Day 3'),
 ('000000005', '000000001', 'FOOD', 300, 'Macdonalds'),
 ('000000006', '000000001', 'FOOD', 600, 'Chinese Restaurant')]

In [33]:
%%sql
select * from has_destination

 * mysql+mysqldb://root:***@localhost/
7 rows affected.

[('000000001', '000000001', 4, datetime.date(2023, 2, 13)),
 ('000000002', '000000002', 2, datetime.date(2023, 3, 31)),
 ('000000002', '000000003', 3, datetime.date(2023, 4, 7)),
 ('000000003', '000000004', 14, datetime.date(2023, 2, 28)),
 ('000000004', '000000005', 2, datetime.date(2023, 6, 15)),
 ('000000005', '000000006', 2, datetime.date(2023, 6, 2)),
 ('000000006', '000000007', 10, datetime.date(2023, 5, 1))]

In [34]:
%%sql
select * from itinerary

 * mysql+mysqldb://root:***@localhost/
7 rows affected.

[('000000001', 1, datetime.timedelta(seconds=32400), 'ATTRACTION', 'penang street', 'George Town'),
 ('000000001', 1, datetime.timedelta(seconds=43200), 'FOOD', 'penang street food', 'Penang Street 1'),
 ('000000001', 2, datetime.timedelta(seconds=28800), 'TOUR', 'malaysia heritage tour', 'Penang Street 5'),
 ('000000003', 1, datetime.timedelta(seconds=32400), 'FOOD', 'Christmas market food', 'Braubachstra√üe'),
 ('000000003', 1, datetime.timedelta(seconds=39600), 'OTHERS', 'Shopping', 'Rewe Gottingen'),
 ('000000005', 1, datetime.timedelta(seconds=50400), 'SIGHTSEEING', 'penang street', 'Penang Street'),
 ('000000005', 1, datetime.timedelta(seconds=64800), 'TOUR', 'CERN Site Tour', 'CERN')]